# Advanced Querying Mongo

**⚠️ IMPORTANT: Limit your print to avoid infinite scrolling. Otherwise your
code will be lost between print lines. If working with lists do:**

```python
list(collection.find(query))[:5] #or a reasonably low number
```

Importing libraries and setting up connection

In [6]:
! conda activate ironhack
!pip install pymongo

CommandNotFoundError: Your shell has not been properly configured to use 'conda activate'.
To initialize your shell, run

    $ conda init <SHELL_NAME>

Currently supported shells are:
  - bash
  - fish
  - tcsh
  - xonsh
  - zsh
  - powershell

See 'conda init --help' for more information and options.

IMPORTANT: You may need to close and restart your shell after running 'conda init'.


Collecting pymongo
  Obtaining dependency information for pymongo from https://files.pythonhosted.org/packages/a7/3c/9f1ad55fbaccf111fc2c3c7309c67035c4dbaed47af92dec3a78d16fe17d/pymongo-4.6.0-cp311-cp311-macosx_10_9_universal2.whl.metadata
  Downloading pymongo-4.6.0-cp311-cp311-macosx_10_9_universal2.whl.metadata (22 kB)
Collecting dnspython<3.0.0,>=1.16.0 (from pymongo)
  Obtaining dependency information for dnspython<3.0.0,>=1.16.0 from https://files.pythonhosted.org/packages/f6/b4/0a9bee52c50f226a3cbfb54263d02bb421c7f2adc136520729c2c689c1e5/dnspython-2.4.2-py3-none-any.whl.metadata
  Downloading dnspython-2.4.2-py3-none-any.whl.metadata (4.9 kB)
Downloading pymongo-4.6.0-cp311-cp311-macosx_10_9_universal2.whl (534 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 534.3/534.3 kB 7.7 MB/s eta 0:00:00 MB/s eta 0:00:01
Using cached dnspython-2.4.2-py3-none-any.whl (300 kB)
Installing collected packages: dnspython, pymongo
Successfully installed dnspython-2.4.2 pymongo-4.6.0

In [134]:
from pymongo import MongoClient
import pandas as pd
import numpy as np
client = MongoClient("mongodb://localhost:27017")

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [50]:
# Your Code
db = client["test"]
db.list_collection_names()
c = db.get_collection("test")
#c.find_one({},{"_id":0})
list(c.find({"name":"Babelgum"}))

[{'_id': ObjectId('52cdef7c4bab8bd675297da0'),
  'name': 'Babelgum',
  'permalink': 'babelgum',
  'crunchbase_url': 'http://www.crunchbase.com/company/babelgum',
  'homepage_url': 'http://babelgum.com',
  'blog_url': 'http://babelgum.com/blog',
  'blog_feed_url': 'http://feeds.feedburner.com/Babelgum',
  'twitter_username': 'Babelgum',
  'category_code': 'games_video',
  'number_of_employees': None,
  'founded_year': 2007,
  'founded_month': 3,
  'founded_day': 1,
  'deadpooled_year': 2013,
  'deadpooled_month': 1,
  'deadpooled_day': 9,
  'deadpooled_url': '',
  'tag_list': 'iptv, web2ireland',
  'alias_list': '',
  'email_address': 'info@babelgum.com',
  'phone_number': '',
  'description': '',
  'created_at': 'Sat Jun 09 08:15:21 UTC 2007',
  'updated_at': 'Wed Oct 16 06:30:25 UTC 2013',
  'overview': '<p>Babelgum is an integrated web and mobile video content platform, free for users and supported by advertising, available on-demand to a global audience.</p>\n\n<p>On March 20th 2009 Babelgum released a U.S. version of its mobile video application for iPhone and iPod Touch (previously available in Italy and the UK) and simultaneously launched a redesigned website (www.babelgum.com) with a Flash-based player, offering one of the first fully integrated video mobile and web user experiences.</p>\n\n<p>Babelgum Mobile is currently available in the United States, UK, Italy, Germany, France and Spain and over 50 other countries across the globe on iPhone 3G, iPod Touch, Google Android G-Phones 1 and 2, Nokia (N96, N95 and 6210) via 3G and WiFi.</p>\n\n<p>Babelgum is an independent and privately held company with offices in the United States, UK, Ireland, France and Italy.</p>\n\n<p>TRAFFIC FIGURES</p>\n\n<p>In July 2009 Babelgum recorded on its website over 2 million monthly unique users worldwide â€“ 1.7 million in the US alone (Source: comScore). Over 2 million people have downloaded the Babelgum mobile applications and watched videos on them.</p>\n\n<p>DEVELOPMENT STRATEGY</p>\n\n<p>In Europe, Babelgum made a strategic agreement with Vodafone to launch a mobile service that allows users to watch videos for free also over 3G networks (Vodafone supports marketing campaigns through SMS and other PR activities targeting their Customer Base). Babelgum is also seeking selected strategic partnerships in the United States.</p>\n\n<p>BABELGUMâ€™S EDITORIAL APPROACH TO CONTENT</p>\n\n<p>Positioned between user generated video hubs and network TV-oriented destinations, Babelgum has a unique editorial approach which focuses on the third part of the ecosystem: innovative, professionally produced content on very specific passions curated by experts in their fields. </p>\n\n<p>The editorial team is driven by professional publishers who scout and select programming for the following channels: Music, Comedy, Film, Our Earth (dedicated to nature and the environment) and Metropolis (all about urban culture and trends). </p>\n\n<p>The mobile and web platforms are integrated functionally and graphically and complement each other, although mobile programming is more carefully tailored to local markets, based on research into national tastes and viewing habits. </p>\n\n<p>Babelgumâ€™s content comprises independent and mainstream programming as well as exclusive original productions.</p>\n\n<p>LIST OF MAIN CONTENT PROVIDERS:</p>\n\n<p>Babelgumâ€™s content partners include, among others, EMI, Sony BMG, the New York Times, PBS, BBC, VBS, Lonely Planet, Coolhunting, National Geographic, Funny or Die, T5M, Shine Limited, Cinetic Rights Management, Content Republic, Gong Anime, The Workbook Project, Cinelan, Power to the Pixel and Off the Fence as well as the Seattle, Encounters, Los Angeles, and Hamptons film festivals.</p>\n\n<p>ONLINE VIDEO COMPETITIONS:</p>\n\n<p>The company has also set up a series of online contests to nurture independent film, music and art talent: the Babelgum Online Film Festival, the Babelgum Music Video Awards and the Babelgum Metropolis Art Prize chaired respectively by Spike Lee, Michel Gondry and Isabella Rossellini.</p>',
  'image': {'available_sizes': [[[135, 102],
     'assets/images/resized/0006/7738/67738v2-max-150x150.png'],
    [[135, 102], 'assets/images/resized/0006/7738/67738v2-max-250x250.png'],
    [[135, 102], 'assets/images/resized/0006/7738/67738v2-max-450x450.png']],
   'attribution': None},
  'products': [{'name': 'Babelgum', 'permalink': 'babelgum'}],
  'relationships': [{'is_past': False,
    'title': 'CEO',
    'person': {'first_name': 'Valerio',
     'last_name': 'Zingarelli',
     'permalink': 'valerio-zingarelli'}},
   {'is_past': True,
    'title': 'CTO',
    'person': {'first_name': 'Mallku',
     'last_name': 'Caballero',
     'permalink': 'mallku-caballero'}},
   {'is_past': True,
    'title': '',
    'person': {'first_name': 'Michael',
     'last_name': "O'Callaghan",
     'permalink': 'michael-o-callaghan'}},
   {'is_past': True,
    'title': '',
    'person': {'first_name': 'Erik',
     'last_name': 'Lumer',
     'permalink': 'erik-lumer'}},
   {'is_past': True,
    'title': 'Engineering Director',
    'person': {'first_name': 'Mark',
     'last_name': 'Kearns',
     'permalink': 'mark-kearns'}}],
  'competitions': [{'competitor': {'name': 'Joost', 'permalink': 'joost'}},
   {'competitor': {'name': 'Zattoo', 'permalink': 'zattoo'}},
   {'competitor': {'name': 'Veoh', 'permalink': 'veoh'}},
   {'competitor': {'name': 'Vudu', 'permalink': 'vudu'}},
   {'competitor': {'name': 'Inuk Networks', 'permalink': 'inuk-networks'}},
   {'competitor': {'name': 'Participatory Culture Foundation',
     'permalink': 'participatory-culture-foundation'}},
   {'competitor': {'name': 'Next New Networks',
     'permalink': 'next-new-networks'}}],
  'providerships': [],
  'total_money_raised': '$13.2M',
  'funding_rounds': [{'id': 17,
    'round_code': 'a',
    'source_url': 'http://www.redherring.com/Article.aspx?a=21800&hed=Battle+of+the+Billionaires&sector=Regions&subsector=Europe',
    'source_description': '',
    'raised_amount': 13200000,
    'raised_currency_code': 'USD',
    'funded_year': 2005,
    'funded_month': 6,
    'funded_day': 1,
    'investments': [{'company': None,
      'financial_org': None,
      'person': {'first_name': 'Silvio',
       'last_name': 'Scaglia',
       'permalink': 'silvio-scaglia'}}]}],
  'investments': [],
  'acquisition': None,
  'acquisitions': [],
  'offices': [{'description': '',
    'address1': '',
    'address2': '',
    'zip_code': '',
    'city': 'London',
    'state_code': None,
    'country_code': 'GBR',
    'latitude': 53.344104,
    'longitude': -6.267494}],
  'milestones': [],
  'ipo': None,
  'video_embeds': [],
  'screenshots': [],
  'external_links': [],
  'partners': []}]

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [89]:
# Your Code
c.find_one({})
filters = {"number_of_employees":  {"$gt": 5000}}
list(c.find(filters, {"_id":0, "name":1, "number_of_employees":1}).sort("number_of_employees", -1))[:20]

[{'name': 'Siemens', 'number_of_employees': 405000},
 {'name': 'IBM', 'number_of_employees': 388000},
 {'name': 'Toyota', 'number_of_employees': 320000},
 {'name': 'PayPal', 'number_of_employees': 300000},
 {'name': 'Nippon Telegraph and Telephone Corporation',
  'number_of_employees': 227000},
 {'name': 'Samsung Electronics', 'number_of_employees': 221726},
 {'name': 'Accenture', 'number_of_employees': 205000},
 {'name': 'Tata Consultancy Services', 'number_of_employees': 200300},
 {'name': 'Flextronics International', 'number_of_employees': 200000},
 {'name': 'Safeway', 'number_of_employees': 186000},
 {'name': 'Sony', 'number_of_employees': 180500},
 {'name': 'LG', 'number_of_employees': 177000},
 {'name': 'Ford', 'number_of_employees': 171000},
 {'name': 'Boeing', 'number_of_employees': 160000},
 {'name': 'Digital Equipment Corporation', 'number_of_employees': 140000},
 {'name': 'Nokia', 'number_of_employees': 125000},
 {'name': 'MItsubishi Electric', 'number_of_employees': 107000},
 {'name': 'MItsubishi Electric', 'number_of_employees': 107000},
 {'name': 'Comcast', 'number_of_employees': 100000},
 {'name': 'Bertelsmann', 'number_of_employees': 100000}]

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [102]:
# Your Code
c.find_one({})
filters = {"founded_year": {"$gte": 2000,"$lte": 2005}}
list(c.find(filters, {"_id":0, "name":1, "founded_year":1, "ipo":1}))[:20]

[{'name': 'Wetpaint', 'founded_year': 2005},
 {'name': 'Zoho', 'founded_year': 2005},
 {'name': 'Digg', 'founded_year': 2004, 'ipo': None},
 {'name': 'Facebook',
  'founded_year': 2004,
  'ipo': {'valuation_amount': 104000000000.0,
   'valuation_currency_code': 'USD',
   'pub_year': 2012,
   'pub_month': 5,
   'pub_day': 18,
   'stock_symbol': 'NASDAQ:FB'}},
 {'name': 'Omnidrive', 'founded_year': 2005, 'ipo': None},
 {'name': 'StumbleUpon', 'founded_year': 2002, 'ipo': None},
 {'name': 'Gizmoz', 'founded_year': 2003, 'ipo': None},
 {'name': 'Helio', 'founded_year': 2005, 'ipo': None},
 {'name': 'Plaxo', 'founded_year': 2002, 'ipo': None},
 {'name': 'Technorati', 'founded_year': 2002, 'ipo': None},
 {'name': 'AddThis', 'founded_year': 2004, 'ipo': None},
 {'name': 'Veoh', 'founded_year': 2004, 'ipo': None},
 {'name': 'Jingle Networks', 'founded_year': 2005, 'ipo': None},
 {'name': 'Meetup', 'founded_year': 2002, 'ipo': None},
 {'name': 'LifeLock',
  'founded_year': 2005,
  'ipo': {'valuation_amount': None,
   'valuation_currency_code': 'USD',
   'pub_year': 2012,
   'pub_month': 10,
   'pub_day': 4,
   'stock_symbol': 'NYSE:LOCK'}},
 {'name': 'Wesabe', 'founded_year': 2005, 'ipo': None},
 {'name': 'Jangl SMS', 'founded_year': 2005, 'ipo': None},
 {'name': 'SmugMug', 'founded_year': 2002, 'ipo': None},
 {'name': 'Jajah', 'founded_year': 2005, 'ipo': None},
 {'name': 'Skype', 'founded_year': 2003, 'ipo': None}]

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [111]:
# Your Code
#c.find_one({})
filters = {"ipo.valuation_amount":{"$gte":100000000}}
list_df = list(c.find(filters, {"_id":0, "name":1, "ipo.valuation_amount":1}))
pd.DataFrame(list_df)

                    name                                   ipo
0               Facebook  {'valuation_amount': 104000000000.0}
1                Twitter   {'valuation_amount': 18100000000.0}
2                   Yelp      {'valuation_amount': 1300000000}
3               LinkedIn    {'valuation_amount': 9310000000.0}
4                 Amazon  {'valuation_amount': 100000000000.0}
5             Brightcove       {'valuation_amount': 290000000}
6            KIT digital       {'valuation_amount': 235000000}
7                 JumpTV       {'valuation_amount': 100000000}
8                Nielsen      {'valuation_amount': 1600000000}
9              OpenTable      {'valuation_amount': 1050000000}
10        ChannelAdvisor       {'valuation_amount': 287000000}
11         Jive Software      {'valuation_amount': 1000000000}
12                Zillow    {'valuation_amount': 2550000000.0}
13                   Wix       {'valuation_amount': 750000000}
14            Shutterfly       {'valuation_amount': 350000000}
15           TripAdvisor    {'valuation_amount': 3273770000.0}
16            Salesforce       {'valuation_amount': 110000000}
17              HomeAway    {'valuation_amount': 3000000000.0}
18                  DivX       {'valuation_amount': 160000000}
19            QuinStreet       {'valuation_amount': 140000000}
20             Rackspace    {'valuation_amount': 5440000000.0}
21          BMC Software    {'valuation_amount': 6000000000.0}
22            Higher One      {'valuation_amount': 1060000000}
23              Infoblox       {'valuation_amount': 824000000}
24               Tencent   {'valuation_amount': 11000000000.0}
25               Marketo       {'valuation_amount': 465000000}
26                 Baidu    {'valuation_amount': 4000000000.0}
27               Geeknet       {'valuation_amount': 134000000}
28               Opsware       {'valuation_amount': 450000000}
29               Telenav       {'valuation_amount': 337000000}
30        Rally Software       {'valuation_amount': 315000000}
31   BrightSource Energy      {'valuation_amount': 1000000000}
32                  Mixi       {'valuation_amount': 970000000}
33              QlikTech      {'valuation_amount': 1000000000}
34                 Chegg      {'valuation_amount': 1100000000}
35                 Chegg      {'valuation_amount': 1100000000}
36               Groupon   {'valuation_amount': 12800000000.0}
37       RPX Corporation      {'valuation_amount': 1096000000}
38            SolarWinds       {'valuation_amount': 803000000}
39                  GREE  {'valuation_amount': 108960000000.0}
40                 Tudou       {'valuation_amount': 174000000}
41             DemandTec       {'valuation_amount': 245000000}
42  Cornerstone OnDemand       {'valuation_amount': 900000000}
43       Western Digital    {'valuation_amount': 9430000000.0}
44      Millennial Media       {'valuation_amount': 973500000}
45                   STR       {'valuation_amount': 300000000}
46                Emdeon       {'valuation_amount': 367350000}
47          Elster Group       {'valuation_amount': 275000000}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [131]:
# Your Code
filters = {"$and":[{"number_of_employees":{"$lt":1000}}, {"founded_year":{"$lt":2005}}]}
df = list(c.find(filters, {"_id":0, "name":1,}).sort("number_of_employees", -1))[:20]
pd.DataFrame(df)

                               name
0              Infinera Corporation
1   NorthPoint Communications Group
2                      888 Holdings
3                Forrester Research
4                         SonicWALL
5                        Webmetrics
6              Cornerstone OnDemand
7                              Yelp
8                           MySpace
9                          ZoomInfo
10                          Mozilla
11                       Buongiorno
12                            Cvent
13                          Wayfair
14                      BitDefender
15       Gateway TechnoLabs Pvt Ltd
16                       LivingLink
17                       LivingLink
18                  Good Technology
19            RightNow Technologies

### 6. All the companies that don't include the `partners` field.

In [140]:
# Your Code
filters = {"test":{"$ne":"partners"}}
df = list(c.find(filters, {"_id":0, "name":1,}))
pd.DataFrame(df)

                      name
0                 Wetpaint
1                AdventNet
2                     Zoho
3                     Digg
4                 Facebook
...                    ...
18796               Adhunk
18797           AfterLogic
18798          goBookmaker
18799  EnteGreat Solutions
18800            EnteGreat

[18801 rows x 1 columns]

### 7. All the companies that have a null type of value on the `category_code` field.

In [143]:
# Your Code
filters = {"category_code":{"$type": "null"}}
df = list(c.find(filters, {"_id":0, "name":1,}))
pd.DataFrame(df)

              name
0       Collective
1          Snimmer
2           KoolIM
3     Level9 Media
4          VidKing
...            ...
2746        Nellix
2747      Cantimer
2748  cruisecritic
2749      Coloroot
2750      Geekdive

[2751 rows x 1 columns]

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [150]:
# Your Code
# Your Code
filters = {"$and":[{"number_of_employees":{"$gte":100}}, {"number_of_employees":{"$lt":1000}}]}
df = c.find(filters, {"_id":0, "number_of_employees":1})
pd.DataFrame(df)

     number_of_employees
0                    600
1                    120
2                    305
3                    644
4                    110
..                   ...
912                  500
913                  100
914                  102
915                  385
916                  164

[917 rows x 1 columns]

### 9. Order all the companies by their IPO price in a descending order.

In [156]:
# Your Code
#c.find_one({})
#filters = {}
list_df = list(c.find(filters, {"_id":0, "name":1, "ipo.valuation_amount":1}).sort("ipo.valuation_amount",-1))
pd.DataFrame(list_df)

                      name                                   ipo
0                     GREE  {'valuation_amount': 108960000000.0}
1                 Facebook  {'valuation_amount': 104000000000.0}
2                   Amazon  {'valuation_amount': 100000000000.0}
3                  Twitter   {'valuation_amount': 18100000000.0}
4                  Groupon   {'valuation_amount': 12800000000.0}
...                    ...                                   ...
18796               Adhunk                                   NaN
18797           AfterLogic                                   NaN
18798          goBookmaker                                   NaN
18799  EnteGreat Solutions                                   NaN
18800            EnteGreat                                   NaN

[18801 rows x 2 columns]

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [158]:
# Your Code
filters = {}
list_df = list(c.find(filters, {"_id":0, "name":1, "number_of_employees":1}).sort("number_of_employees",-1))[:20]
pd.DataFrame(list_df)

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [165]:
# Your Code
filters = {"founded_month":{"$in":list(range(6,13))}}
df = list(c.find(filters, {"_id":0, "number_of_employees":1}))
pd.DataFrame(df)

      number_of_employees
0                    47.0
1                  1600.0
2                    60.0
3                     NaN
4                     NaN
...                   ...
4032                  NaN
4033                  NaN
4034                 55.0
4035                  1.0
4036                102.0

[4037 rows x 1 columns]

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.000

In [239]:
# Your Code
filters = {"$and":[{"founded_year":{"$lt":2000}},{"acquisition.price_amount":{"$gt":10000000}}]}
df = list(c.find(filters, {"_id":0, "name":1}))[:10]
pd.DataFrame(df)

               name
0           Postini
1          SideStep
2        Recipezaar
3            PayPal
4          Snapfish
5           Neopets
6  Sun Microsystems
7            Zappos
8           Alibaba
9             Sabre

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [222]:
# Your Code
filters = {"$and":[{"acquisitions.acquired_year":{"$gt":2010}},{"acquisition":{"$ne":None}}]}
df = list(c.find(filters, {"_id":0, "name":1, "acquisition":1}).sort("acquisition.price_amount",1))[20:]
pd.DataFrame(df)

,name,acquisition
0,TeleTech,"{'price_amount': None, 'price_currency_code': ..."
1,TeleTech,"{'price_amount': None, 'price_currency_code': ..."
2,nCircle Network Security,"{'price_amount': None, 'price_currency_code': ..."
3,Vendio,"{'price_amount': None, 'price_currency_code': ..."
4,Brickfish,"{'price_amount': None, 'price_currency_code': ..."
...,...,...
73,Qualcomm Atheros,"{'price_amount': 3100000000.0, 'price_currency..."
74,SuccessFactors,"{'price_amount': 3400000000.0, 'price_currency..."
75,The Weather Channel,"{'price_amount': 3500000000.0, 'price_currency..."
76,Sabre,"{'price_amount': 4300000000.0, 'price_currency..."
77,LSI,"{'price_amount': 6600000000.0, 'price_currency..."

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [228]:
# Your Code
filters = {"founded_year":{"$ne":None}}
df = list(c.find(filters, {"_id":0, "name":1, "founded_year":1}))[:20]
pd.DataFrame(df)

                     name  founded_year
0                Wetpaint          2005
1               AdventNet          1996
2                    Zoho          2005
3                    Digg          2004
4                Facebook          2004
5               Omnidrive          2005
6                 Postini          1999
7                    Geni          2006
8   Fox Interactive Media          1979
9                 Twitter          2006
10            StumbleUpon          2002
11                 Gizmoz          2003
12                 Scribd          2007
13                Slacker          2006
14                  Helio          2005
15                   eBay          1995
16                MeetMoi          2007
17                  Joost          2006
18                    CBS          1986
19                 Viacom          1971

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [237]:
# Your Code
filters = {"founded_day":{"$in":list(range(1,8))}}
df = list(c.find(filters, {"_id":0, "name":1}).sort("acquisition.price_amount",-1))
pd.DataFrame(df)

              name
0         Netscape
1           PayPal
2           Zappos
3          Alibaba
4          Postini
...            ...
3216      SEO Sumo
3217  Kicker Films
3218        Getyoo
3219      cotralis
3220        Oriact

[3221 rows x 1 columns]

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [238]:
# Your Code
filters = {"$and": [{"category_code":"web"},{"number_of_employees":{"$gt":4000}}]}
df = list(c.find(filters, {"_id":0, "name":1}).sort("number",1))
pd.DataFrame(df)

                            name
0                           eBay
1                         Yahoo!
2                            AOL
3                        Webkinz
4                        Rakuten
5                        Expedia
6                       Experian
7  Los Angeles Times Media Group
8                        Groupon

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [242]:
# Your Code
filters = {"$and":[{"acquisition.price_currency_code":"EUR"},{"acquisition.price_amount":{"$gt":10000000}}]}
df = list(c.find(filters, {"_id":0, "name":1}))[:10]
pd.DataFrame(df)

                  name
0                  ZYB
1              Apertio
2    Greenfield Online
3              Webedia
4            Wayfinder
5  Tuenti Technologies
6       BioMed Central

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [244]:
# Your Code
filters = {"founded_month":{"$in":list(range(1,4))}}
df = list(c.find(filters, {"_id":0, "name":1, "acquisition.price_amount":1}).sort("acquisition.price_amount",-1))[:10]
pd.DataFrame(df)

               name                     acquisition
0  Sun Microsystems  {'price_amount': 7400000000.0}
1    Siebel Systems  {'price_amount': 5850000000.0}
2           YouTube    {'price_amount': 1650000000}
3            Zappos    {'price_amount': 1200000000}
4            Tumblr    {'price_amount': 1100000000}
5      Kiva Systems     {'price_amount': 775000000}
6           Playdom     {'price_amount': 763200000}
7         SonicWALL     {'price_amount': 717000000}
8          Lightera     {'price_amount': 552000000}
9        OptiMedica     {'price_amount': 400000000}

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [ ]:
# Your Code

### 20. All the companies that have been 'deadpooled' after the third year.

In [ ]:
# Your Code

**⚠️ Did you do this?**

```python
list(collection.find(query))[:5] #or a reasonably low number
```